import React, {useEffect} from "react";
import "./stylesSecretPage.scss";
import chelick1 from "../../images/челик 1.png";
import chelick2 from "../../images/челик 2.png";
import chelick3 from "../../images/челик 3.png";
import logo from "../../images/лобо БД 2.0 малое.png";
import {useHistory} from "react-router-dom";

import Chelick from "./chelick";

const SecretPage = ({isLogined}) => {
    const history = useHistory();
    useEffect(() => {
        if (!isLogined) {
            history.push("/#");
            alert("nonono");
        }
    }, [isLogined]);
    return (
        <div className="secret-page w-100">
            <header className="secret-page-header"><img src={logo} width="40px" alt="chelik"/><span className="min-width-520">внутрішній документ</span> <small>№0000032478123</small></header>
            <div className="hr-line"/>
            <main className="secret-page-content">
                <Chelick img={chelick1} data={{phone:'+380667374545', name: 'Олег'}} text={'1999 року народження. Батьки розлучені, та позбавлені батьківських прав через домашнє насильство. Затриманий у бібліотеці КПІ. При собі заборонених предметів та речовин не мав. В ході обшуку було вилучено крейду та книгу «Шифри». Під час допиту не спричиняв опору, і відповідав на всі питання. Після перевірки особистих даних було виявлено медичну картку із зазначенням психічних порушень, та суїцидальних схильностей. Провівши аналіз крові було виявлено сліди наркотичного сп’яніння. Відносин із потерпілою не заперечує. Розповідає про давню дружбу з загиблою та часті затримання з нею у бібліотеці. На запитання щодо алібі, було встановлено, що Він провів всю ніч з 30 на 31 жовтня з друзями, █████ Валерієм та ██████████ Юрієм. Зазначені особи проходять в якості свідків, і на допиті підтвердили правдивість свідчень підозрюваного.'}/>
                <Chelick img={chelick2} data={{phone:'+7 778 437 37 40', name: 'Олег'}} text={'1998 року народження. Сирота, батьки розлучилися у віці 6 років, через 2 роки померла мати, через 3 – батько. Був затриманий під час прогулянки парком КПІ. При собі заборонених предметів та речовин не мав. В ході обшуку були вилучені латино-російський словник, та антидепресанти. Під час допиту поводився дивно. Звинувачував у невірності та злісно посміхався. Після перевірки особистих даних, виявлено інформацію про відвідування психоневрологічного диспансеру, та курсів для людей з ОКР. Провівши аналіз крові не було виявлено наркотичних речовин, та ознак алкогольного сп’яніння. Відносин із потерпілою не заперечує. Про постраждалу каже лише у гарному тоні, посилаючись на довготривалі любовні зв’язки. На запитання щодо його алібі, було встановлено, що він всю ніч за 30 на 31 жовтня він провів у кімнаті гуртожитку. Завідуюча підтвердила його присутність, проте невідомо, чи був підозрюваний за зазначеною адресою в момент вбивства. На запису камери спостереження, встановленої за адресою вул. ████████, буд. 3 помітно особу, схожу на підозрюваного. Замовлено експертизу запису.'}/>
                <Chelick img={chelick3} data={{phone:'+380667447544', name: 'Петро'}} text={'1998 року народження. Сирота, батьки розлучилися у віці 7 років. Був затриманий на хакатоні з кібербезпеки. При собі заборонених речовин та предметів не мав. В ході обшуку було виявлено щоденник. Під час допиту було називав себе посланцем бога, та лаяв слідчих. Після перевірки особистих даних було винайдено медичну карту з зазначенням олігофренії та ОКР. Провівши аналіз крові не було виявлено наркотичних речовин, та ознак алкогольного сп’яніння. Заперечує відносини із потерпілою. Під час допиту знайомих Олега було виявлено, що насправді він часто відвідував бібліотеку і був знайомий із Катериною. На запитання щодо алібі, заявив про те, що з ранку 29 до 14:00 31 жовтня не виходив з квартири, займаючись підготовкою до хакатону. Дані свідчення наразі не перевірено.'}/>
            </main>
        </div>
    )
}

export default SecretPage;
